GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: PSTR2CON
#define PSTR2CON PSTR2CON
PSTR2CON                                 equ 0F1Bh
// bitfield definitions
PSTR2CON_STRA_POSN                       equ 0000h
PSTR2CON_STRA_POSITION                   equ 0000h
PSTR2CON_STRA_SIZE                       equ 0001h
PSTR2CON_STRA_LENGTH                     equ 0001h
PSTR2CON_STRA_MASK                       equ 0001h
PSTR2CON_STRB_POSN                       equ 0001h
PSTR2CON_STRB_POSITION                   equ 0001h
PSTR2CON_STRB_SIZE                       equ 0001h
PSTR2CON_STRB_LENGTH                     equ 0001h
PSTR2CON_STRB_MASK                       equ 0002h
PSTR2CON_STRC_POSN                       equ 0002h
PSTR2CON_STRC_POSITION                   equ 0002h
PSTR2CON_STRC_SIZE                       equ 0001h
PSTR2CON_STRC_LENGTH                     equ 0001h
PSTR2CON_STRC_MASK                       equ 0004h
PSTR2CON_STRD_POSN                       equ 0003h
PSTR2CON_STRD_POSITION                   equ 0003h
PSTR2CON_STRD_SIZE                       equ 0001h
PSTR2CON_STRD_LENGTH                     equ 0001h
PSTR2CON_STRD_MASK                       equ 0008h
PSTR2CON_STRSYNC_POSN                    equ 0004h
PSTR2CON_STRSYNC_POSITION                equ 0004h
PSTR2CON_STRSYNC_SIZE                    equ 0001h
PSTR2CON_STRSYNC_LENGTH                  equ 0001h
PSTR2CON_STRSYNC_MASK                    equ 0010h
PSTR2CON_CMPL_POSN                       equ 0006h
PSTR2CON_CMPL_POSITION                   equ 0006h
PSTR2CON_CMPL_SIZE                       equ 0002h
PSTR2CON_CMPL_LENGTH                     equ 0002h
PSTR2CON_CMPL_MASK                       equ 00C0h
PSTR2CON_CMPL0_POSN                      equ 0006h
PSTR2CON_CMPL0_POSITION                  equ 0006h
PSTR2CON_CMPL0_SIZE                      equ 0001h
PSTR2CON_CMPL0_LENGTH                    equ 0001h
PSTR2CON_CMPL0_MASK                      equ 0040h
PSTR2CON_CMPL1_POSN                      equ 0007h
PSTR2CON_CMPL1_POSITION                  equ 0007h
PSTR2CON_CMPL1_SIZE                      equ 0001h
PSTR2CON_CMPL1_LENGTH                    equ 0001h
PSTR2CON_CMPL1_MASK                      equ 0080h
PSTR2CON_P2DC02_POSN                     equ 0000h
PSTR2CON_P2DC02_POSITION                 equ 0000h
PSTR2CON_P2DC02_SIZE                     equ 0001h
PSTR2CON_P2DC02_LENGTH                   equ 0001h
PSTR2CON_P2DC02_MASK                     equ 0001h
PSTR2CON_P2DC12_POSN                     equ 0001h
PSTR2CON_P2DC12_POSITION                 equ 0001h
PSTR2CON_P2DC12_SIZE                     equ 0001h
PSTR2CON_P2DC12_LENGTH                   equ 0001h
PSTR2CON_P2DC12_MASK                     equ 0002h
PSTR2CON_P2DC22_POSN                     equ 0002h
PSTR2CON_P2DC22_POSITION                 equ 0002h
PSTR2CON_P2DC22_SIZE                     equ 0001h
PSTR2CON_P2DC22_LENGTH                   equ 0001h
PSTR2CON_P2DC22_MASK                     equ 0004h
PSTR2CON_P2DC32_POSN                     equ 0003h
PSTR2CON_P2DC32_POSITION                 equ 0003h
PSTR2CON_P2DC32_SIZE                     equ 0001h
PSTR2CON_P2DC32_LENGTH                   equ 0001h
PSTR2CON_P2DC32_MASK                     equ 0008h
PSTR2CON_P2DC42_POSN                     equ 0004h
PSTR2CON_P2DC42_POSITION                 equ 0004h
PSTR2CON_P2DC42_SIZE                     equ 0001h
PSTR2CON_P2DC42_LENGTH                   equ 0001h
PSTR2CON_P2DC42_MASK                     equ 0010h
PSTR2CON_CMPL02_POSN                     equ 0006h
PSTR2CON_CMPL02_POSITION                 equ 0006h
PSTR2CON_CMPL02_SIZE                     equ 0001h
PSTR2CON_CMPL02_LENGTH                   equ 0001h
PSTR2CON_CMPL02_MASK                     equ 0040h
PSTR2CON_CMPL12_POSN                     equ 0007h
PSTR2CON_CMPL12_POSITION                 equ 0007h
PSTR2CON_CMPL12_SIZE                     equ 0001h
PSTR2CON_CMPL12_LENGTH                   equ 0001h
PSTR2CON_CMPL12_MASK                     equ 0080h
PSTR2CON_P2DC0CON_POSN                   equ 0000h
PSTR2CON_P2DC0CON_POSITION               equ 0000h
PSTR2CON_P2DC0CON_SIZE                   equ 0001h
PSTR2CON_P2DC0CON_LENGTH                 equ 0001h
PSTR2CON_P2DC0CON_MASK                   equ 0001h
PSTR2CON_P2DC1CON_POSN                   equ 0001h
PSTR2CON_P2DC1CON_POSITION               equ 0001h
PSTR2CON_P2DC1CON_SIZE                   equ 0001h
PSTR2CON_P2DC1CON_LENGTH                 equ 0001h
PSTR2CON_P2DC1CON_MASK                   equ 0002h
PSTR2CON_P2DC2CON_POSN                   equ 0002h
PSTR2CON_P2DC2CON_POSITION               equ 0002h
PSTR2CON_P2DC2CON_SIZE                   equ 0001h
PSTR2CON_P2DC2CON_LENGTH                 equ 0001h
PSTR2CON_P2DC2CON_MASK                   equ 0004h
PSTR2CON_P2DC3CON_POSN                   equ 0003h
PSTR2CON_P2DC3CON_POSITION               equ 0003h
PSTR2CON_P2DC3CON_SIZE                   equ 0001h
PSTR2CON_P2DC3CON_LENGTH                 equ 0001h
PSTR2CON_P2DC3CON_MASK                   equ 0008h
PSTR2CON_P2DC4CON_POSN                   equ 0004h
PSTR2CON_P2DC4CON_POSITION               equ 0004h
PSTR2CON_P2DC4CON_SIZE                   equ 0001h
PSTR2CON_P2DC4CON_LENGTH                 equ 0001h
PSTR2CON_P2DC4CON_MASK                   equ 0010h
PSTR2CON_P2DC62_POSN                     equ 0006h
PSTR2CON_P2DC62_POSITION                 equ 0006h
PSTR2CON_P2DC62_SIZE                     equ 0001h
PSTR2CON_P2DC62_LENGTH                   equ 0001h
PSTR2CON_P2DC62_MASK                     equ 0040h
PSTR2CON_STRA2_POSN                      equ 0000h
PSTR2CON_STRA2_POSITION                  equ 0000h
PSTR2CON_STRA2_SIZE                      equ 0001h
PSTR2CON_STRA2_LENGTH                    equ 0001h
PSTR2CON_STRA2_MASK                      equ 0001h
PSTR2CON_STRB2_POSN                      equ 0001h
PSTR2CON_STRB2_POSITION                  equ 0001h
PSTR2CON_STRB2_SIZE                      equ 0001h
PSTR2CON_STRB2_LENGTH                    equ 0001h
PSTR2CON_STRB2_MASK                      equ 0002h
PSTR2CON_STRC2_POSN                      equ 0002h
PSTR2CON_STRC2_POSITION                  equ 0002h
PSTR2CON_STRC2_SIZE                      equ 0001h
PSTR2CON_STRC2_LENGTH                    equ 0001h
PSTR2CON_STRC2_MASK                      equ 0004h
PSTR2CON_STRD2_POSN                      equ 0003h
PSTR2CON_STRD2_POSITION                  equ 0003h
PSTR2CON_STRD2_SIZE                      equ 0001h
PSTR2CON_STRD2_LENGTH                    equ 0001h
PSTR2CON_STRD2_MASK                      equ 0008h
PSTR2CON_STRSYNC2_POSN                   equ 0004h
PSTR2CON_STRSYNC2_POSITION               equ 0004h
PSTR2CON_STRSYNC2_SIZE                   equ 0001h
PSTR2CON_STRSYNC2_LENGTH                 equ 0001h
PSTR2CON_STRSYNC2_MASK                   equ 0010h
PSTR2CON_P2DC6CON_POSN                   equ 0006h
PSTR2CON_P2DC6CON_POSITION               equ 0006h
PSTR2CON_P2DC6CON_SIZE                   equ 0001h
PSTR2CON_P2DC6CON_LENGTH                 equ 0001h
PSTR2CON_P2DC6CON_MASK                   equ 0040h

// Register: TXREG2
#define TXREG2 TXREG2
TXREG2                                   equ 0F1Ch
// bitfield definitions
TXREG2_TXREG2_POSN                       equ 0000h
TXREG2_TXREG2_POSITION                   equ 0000h
TXREG2_TXREG2_SIZE                       equ 0008h
TXREG2_TXREG2_LENGTH                     equ 0008h
TXREG2_TXREG2_MASK                       equ 00FFh

// Register: RCREG2
#define RCREG2 RCREG2
RCREG2                                   equ 0F1Dh
// bitfield definitions
RCREG2_RCREG2_POSN                       equ 0000h
RCREG2_RCREG2_POSITION                   equ 0000h
RCREG2_RCREG2_SIZE                       equ 0008h
RCREG2_RCREG2_LENGTH                     equ 0008h
RCREG2_RCREG2_MASK                       equ 00FFh

