GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: T7CON
#define T7CON T7CON
T7CON                                    equ 0F3Dh
// bitfield definitions
T7CON_NOT_T7SYNC_POSN                    equ 0002h
T7CON_NOT_T7SYNC_POSITION                equ 0002h
T7CON_NOT_T7SYNC_SIZE                    equ 0001h
T7CON_NOT_T7SYNC_LENGTH                  equ 0001h
T7CON_NOT_T7SYNC_MASK                    equ 0004h
T7CON_TMR7ON_POSN                        equ 0000h
T7CON_TMR7ON_POSITION                    equ 0000h
T7CON_TMR7ON_SIZE                        equ 0001h
T7CON_TMR7ON_LENGTH                      equ 0001h
T7CON_TMR7ON_MASK                        equ 0001h
T7CON_RD16_POSN                          equ 0001h
T7CON_RD16_POSITION                      equ 0001h
T7CON_RD16_SIZE                          equ 0001h
T7CON_RD16_LENGTH                        equ 0001h
T7CON_RD16_MASK                          equ 0002h
T7CON_nT7SYNC_POSN                       equ 0002h
T7CON_nT7SYNC_POSITION                   equ 0002h
T7CON_nT7SYNC_SIZE                       equ 0001h
T7CON_nT7SYNC_LENGTH                     equ 0001h
T7CON_nT7SYNC_MASK                       equ 0004h
T7CON_SOSCEN_POSN                        equ 0003h
T7CON_SOSCEN_POSITION                    equ 0003h
T7CON_SOSCEN_SIZE                        equ 0001h
T7CON_SOSCEN_LENGTH                      equ 0001h
T7CON_SOSCEN_MASK                        equ 0008h
T7CON_T7CKPS_POSN                        equ 0004h
T7CON_T7CKPS_POSITION                    equ 0004h
T7CON_T7CKPS_SIZE                        equ 0002h
T7CON_T7CKPS_LENGTH                      equ 0002h
T7CON_T7CKPS_MASK                        equ 0030h
T7CON_TMR7CS_POSN                        equ 0006h
T7CON_TMR7CS_POSITION                    equ 0006h
T7CON_TMR7CS_SIZE                        equ 0002h
T7CON_TMR7CS_LENGTH                      equ 0002h
T7CON_TMR7CS_MASK                        equ 00C0h
T7CON_T7CKPS0_POSN                       equ 0004h
T7CON_T7CKPS0_POSITION                   equ 0004h
T7CON_T7CKPS0_SIZE                       equ 0001h
T7CON_T7CKPS0_LENGTH                     equ 0001h
T7CON_T7CKPS0_MASK                       equ 0010h
T7CON_T7CKPS1_POSN                       equ 0005h
T7CON_T7CKPS1_POSITION                   equ 0005h
T7CON_T7CKPS1_SIZE                       equ 0001h
T7CON_T7CKPS1_LENGTH                     equ 0001h
T7CON_T7CKPS1_MASK                       equ 0020h
T7CON_TMR7CS0_POSN                       equ 0006h
T7CON_TMR7CS0_POSITION                   equ 0006h
T7CON_TMR7CS0_SIZE                       equ 0001h
T7CON_TMR7CS0_LENGTH                     equ 0001h
T7CON_TMR7CS0_MASK                       equ 0040h
T7CON_TMR7CS1_POSN                       equ 0007h
T7CON_TMR7CS1_POSITION                   equ 0007h
T7CON_TMR7CS1_SIZE                       equ 0001h
T7CON_TMR7CS1_LENGTH                     equ 0001h
T7CON_TMR7CS1_MASK                       equ 0080h
T7CON_RD167_POSN                         equ 0001h
T7CON_RD167_POSITION                     equ 0001h
T7CON_RD167_SIZE                         equ 0001h
T7CON_RD167_LENGTH                       equ 0001h
T7CON_RD167_MASK                         equ 0002h
T7CON_SOSCEN7_POSN                       equ 0003h
T7CON_SOSCEN7_POSITION                   equ 0003h
T7CON_SOSCEN7_SIZE                       equ 0001h
T7CON_SOSCEN7_LENGTH                     equ 0001h
T7CON_SOSCEN7_MASK                       equ 0008h

// Register: TMR7
#define TMR7 TMR7
TMR7                                     equ 0F3Eh

// Register: TMR7L
#define TMR7L TMR7L
TMR7L                                    equ 0F3Eh
// bitfield definitions
TMR7L_TMR7L_POSN                         equ 0000h
TMR7L_TMR7L_POSITION                     equ 0000h
TMR7L_TMR7L_SIZE                         equ 0008h
TMR7L_TMR7L_LENGTH                       equ 0008h
TMR7L_TMR7L_MASK                         equ 00FFh
TMR7L_CAL07_POSN                         equ 0000h
TMR7L_CAL07_POSITION                     equ 0000h
TMR7L_CAL07_SIZE                         equ 0001h
TMR7L_CAL07_LENGTH                       equ 0001h
TMR7L_CAL07_MASK                         equ 0001h
TMR7L_CAL17_POSN                         equ 0001h
TMR7L_CAL17_POSITION                     equ 0001h
TMR7L_CAL17_SIZE                         equ 0001h
TMR7L_CAL17_LENGTH                       equ 0001h
TMR7L_CAL17_MASK                         equ 0002h
TMR7L_CAL27_POSN                         equ 0002h
TMR7L_CAL27_POSITION                     equ 0002h
TMR7L_CAL27_SIZE                         equ 0001h
TMR7L_CAL27_LENGTH                       equ 0001h
TMR7L_CAL27_MASK                         equ 0004h
TMR7L_CAL37_POSN                         equ 0003h
TMR7L_CAL37_POSITION                     equ 0003h
TMR7L_CAL37_SIZE                         equ 0001h
TMR7L_CAL37_LENGTH                       equ 0001h
TMR7L_CAL37_MASK                         equ 0008h
TMR7L_CAL47_POSN                         equ 0004h
TMR7L_CAL47_POSITION                     equ 0004h
TMR7L_CAL47_SIZE                         equ 0001h
TMR7L_CAL47_LENGTH                       equ 0001h
TMR7L_CAL47_MASK                         equ 0010h
TMR7L_CAL57_POSN                         equ 0005h
TMR7L_CAL57_POSITION                     equ 0005h
TMR7L_CAL57_SIZE                         equ 0001h
TMR7L_CAL57_LENGTH                       equ 0001h
TMR7L_CAL57_MASK                         equ 0020h
TMR7L_CAL67_POSN                         equ 0006h
TMR7L_CAL67_POSITION                     equ 0006h
TMR7L_CAL67_SIZE                         equ 0001h
TMR7L_CAL67_LENGTH                       equ 0001h
TMR7L_CAL67_MASK                         equ 0040h
TMR7L_CAL77_POSN                         equ 0007h
TMR7L_CAL77_POSITION                     equ 0007h
TMR7L_CAL77_SIZE                         equ 0001h
TMR7L_CAL77_LENGTH                       equ 0001h
TMR7L_CAL77_MASK                         equ 0080h

// Register: TMR7H
#define TMR7H TMR7H
TMR7H                                    equ 0F3Fh
// bitfield definitions
TMR7H_TMR7H_POSN                         equ 0000h
TMR7H_TMR7H_POSITION                     equ 0000h
TMR7H_TMR7H_SIZE                         equ 0008h
TMR7H_TMR7H_LENGTH                       equ 0008h
TMR7H_TMR7H_MASK                         equ 00FFh

// Register: CCP10CON
#define CCP10CON CCP10CON
CCP10CON                                 equ 0F40h
// bitfield definitions
CCP10CON_CCP10M_POSN                     equ 0000h
CCP10CON_CCP10M_POSITION                 equ 0000h
CCP10CON_CCP10M_SIZE                     equ 0004h
CCP10CON_CCP10M_LENGTH                   equ 0004h
CCP10CON_CCP10M_MASK                     equ 000Fh
CCP10CON_DC10B_POSN                      equ 0004h
CCP10CON_DC10B_POSITION                  equ 0004h
CCP10CON_DC10B_SIZE                      equ 0002h
CCP10CON_DC10B_LENGTH                    equ 0002h
CCP10CON_DC10B_MASK                      equ 0030h
CCP10CON_CCP10M0_POSN                    equ 0000h
CCP10CON_CCP10M0_POSITION                equ 0000h
CCP10CON_CCP10M0_SIZE                    equ 0001h
CCP10CON_CCP10M0_LENGTH                  equ 0001h
CCP10CON_CCP10M0_MASK                    equ 0001h
CCP10CON_CCP10M1_POSN                    equ 0001h
CCP10CON_CCP10M1_POSITION                equ 0001h
CCP10CON_CCP10M1_SIZE                    equ 0001h
CCP10CON_CCP10M1_LENGTH                  equ 0001h
CCP10CON_CCP10M1_MASK                    equ 0002h
CCP10CON_CCP10M2_POSN                    equ 0002h
CCP10CON_CCP10M2_POSITION                equ 0002h
CCP10CON_CCP10M2_SIZE                    equ 0001h
CCP10CON_CCP10M2_LENGTH                  equ 0001h
CCP10CON_CCP10M2_MASK                    equ 0004h
CCP10CON_CCP10M3_POSN                    equ 0003h
CCP10CON_CCP10M3_POSITION                equ 0003h
CCP10CON_CCP10M3_SIZE                    equ 0001h
CCP10CON_CCP10M3_LENGTH                  equ 0001h
CCP10CON_CCP10M3_MASK                    equ 0008h
CCP10CON_DC10B0_POSN                     equ 0004h
CCP10CON_DC10B0_POSITION                 equ 0004h
CCP10CON_DC10B0_SIZE                     equ 0001h
CCP10CON_DC10B0_LENGTH                   equ 0001h
CCP10CON_DC10B0_MASK                     equ 0010h
CCP10CON_DC10B1_POSN                     equ 0005h
CCP10CON_DC10B1_POSITION                 equ 0005h
CCP10CON_DC10B1_SIZE                     equ 0001h
CCP10CON_DC10B1_LENGTH                   equ 0001h
CCP10CON_DC10B1_MASK                     equ 0020h
CCP10CON_CCP10Y_POSN                     equ 0004h
CCP10CON_CCP10Y_POSITION                 equ 0004h
CCP10CON_CCP10Y_SIZE                     equ 0001h
CCP10CON_CCP10Y_LENGTH                   equ 0001h
CCP10CON_CCP10Y_MASK                     equ 0010h
CCP10CON_CCP10X_POSN                     equ 0005h
CCP10CON_CCP10X_POSITION                 equ 0005h
CCP10CON_CCP10X_SIZE                     equ 0001h
CCP10CON_CCP10X_LENGTH                   equ 0001h
CCP10CON_CCP10X_MASK                     equ 0020h

// Register: CCPR10
#define CCPR10 CCPR10
CCPR10                                   equ 0F41h

// Register: CCPR10L
#define CCPR10L CCPR10L
CCPR10L                                  equ 0F41h
// bitfield definitions
CCPR10L_CCPR10L_POSN                     equ 0000h
CCPR10L_CCPR10L_POSITION                 equ 0000h
CCPR10L_CCPR10L_SIZE                     equ 0008h
CCPR10L_CCPR10L_LENGTH                   equ 0008h
CCPR10L_CCPR10L_MASK                     equ 00FFh

