GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0F50h
// bitfield definitions
CCPR2H_CCPR2H_POSN                       equ 0000h
CCPR2H_CCPR2H_POSITION                   equ 0000h
CCPR2H_CCPR2H_SIZE                       equ 0008h
CCPR2H_CCPR2H_LENGTH                     equ 0008h
CCPR2H_CCPR2H_MASK                       equ 00FFh

// Register: ECCP2DEL
#define ECCP2DEL ECCP2DEL
ECCP2DEL                                 equ 0F51h
// bitfield definitions
ECCP2DEL_P2DC_POSN                       equ 0000h
ECCP2DEL_P2DC_POSITION                   equ 0000h
ECCP2DEL_P2DC_SIZE                       equ 0007h
ECCP2DEL_P2DC_LENGTH                     equ 0007h
ECCP2DEL_P2DC_MASK                       equ 007Fh
ECCP2DEL_P2RSEN_POSN                     equ 0007h
ECCP2DEL_P2RSEN_POSITION                 equ 0007h
ECCP2DEL_P2RSEN_SIZE                     equ 0001h
ECCP2DEL_P2RSEN_LENGTH                   equ 0001h
ECCP2DEL_P2RSEN_MASK                     equ 0080h
ECCP2DEL_P2DC0_POSN                      equ 0000h
ECCP2DEL_P2DC0_POSITION                  equ 0000h
ECCP2DEL_P2DC0_SIZE                      equ 0001h
ECCP2DEL_P2DC0_LENGTH                    equ 0001h
ECCP2DEL_P2DC0_MASK                      equ 0001h
ECCP2DEL_P2DC1_POSN                      equ 0001h
ECCP2DEL_P2DC1_POSITION                  equ 0001h
ECCP2DEL_P2DC1_SIZE                      equ 0001h
ECCP2DEL_P2DC1_LENGTH                    equ 0001h
ECCP2DEL_P2DC1_MASK                      equ 0002h
ECCP2DEL_P2DC2_POSN                      equ 0002h
ECCP2DEL_P2DC2_POSITION                  equ 0002h
ECCP2DEL_P2DC2_SIZE                      equ 0001h
ECCP2DEL_P2DC2_LENGTH                    equ 0001h
ECCP2DEL_P2DC2_MASK                      equ 0004h
ECCP2DEL_P2DC3_POSN                      equ 0003h
ECCP2DEL_P2DC3_POSITION                  equ 0003h
ECCP2DEL_P2DC3_SIZE                      equ 0001h
ECCP2DEL_P2DC3_LENGTH                    equ 0001h
ECCP2DEL_P2DC3_MASK                      equ 0008h
ECCP2DEL_P2DC4_POSN                      equ 0004h
ECCP2DEL_P2DC4_POSITION                  equ 0004h
ECCP2DEL_P2DC4_SIZE                      equ 0001h
ECCP2DEL_P2DC4_LENGTH                    equ 0001h
ECCP2DEL_P2DC4_MASK                      equ 0010h
ECCP2DEL_P2DC5_POSN                      equ 0005h
ECCP2DEL_P2DC5_POSITION                  equ 0005h
ECCP2DEL_P2DC5_SIZE                      equ 0001h
ECCP2DEL_P2DC5_LENGTH                    equ 0001h
ECCP2DEL_P2DC5_MASK                      equ 0020h
ECCP2DEL_P2DC6_POSN                      equ 0006h
ECCP2DEL_P2DC6_POSITION                  equ 0006h
ECCP2DEL_P2DC6_SIZE                      equ 0001h
ECCP2DEL_P2DC6_LENGTH                    equ 0001h
ECCP2DEL_P2DC6_MASK                      equ 0040h

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0F52h
// bitfield definitions
ECCP2AS_PSS2BD_POSN                      equ 0000h
ECCP2AS_PSS2BD_POSITION                  equ 0000h
ECCP2AS_PSS2BD_SIZE                      equ 0002h
ECCP2AS_PSS2BD_LENGTH                    equ 0002h
ECCP2AS_PSS2BD_MASK                      equ 0003h
ECCP2AS_PSS2AC_POSN                      equ 0002h
ECCP2AS_PSS2AC_POSITION                  equ 0002h
ECCP2AS_PSS2AC_SIZE                      equ 0002h
ECCP2AS_PSS2AC_LENGTH                    equ 0002h
ECCP2AS_PSS2AC_MASK                      equ 000Ch
ECCP2AS_ECCP2AS_POSN                     equ 0004h
ECCP2AS_ECCP2AS_POSITION                 equ 0004h
ECCP2AS_ECCP2AS_SIZE                     equ 0003h
ECCP2AS_ECCP2AS_LENGTH                   equ 0003h
ECCP2AS_ECCP2AS_MASK                     equ 0070h
ECCP2AS_ECCP2ASE_POSN                    equ 0007h
ECCP2AS_ECCP2ASE_POSITION                equ 0007h
ECCP2AS_ECCP2ASE_SIZE                    equ 0001h
ECCP2AS_ECCP2ASE_LENGTH                  equ 0001h
ECCP2AS_ECCP2ASE_MASK                    equ 0080h
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h
ECCP2AS_ECCP2AS0_POSN                    equ 0004h
ECCP2AS_ECCP2AS0_POSITION                equ 0004h
ECCP2AS_ECCP2AS0_SIZE                    equ 0001h
ECCP2AS_ECCP2AS0_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS0_MASK                    equ 0010h
ECCP2AS_ECCP2AS1_POSN                    equ 0005h
ECCP2AS_ECCP2AS1_POSITION                equ 0005h
ECCP2AS_ECCP2AS1_SIZE                    equ 0001h
ECCP2AS_ECCP2AS1_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS1_MASK                    equ 0020h
ECCP2AS_ECCP2AS2_POSN                    equ 0006h
ECCP2AS_ECCP2AS2_POSITION                equ 0006h
ECCP2AS_ECCP2AS2_SIZE                    equ 0001h
ECCP2AS_ECCP2AS2_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS2_MASK                    equ 0040h

// Register: PADCFG1
#define PADCFG1 PADCFG1
PADCFG1                                  equ 0F53h
// bitfield definitions
PADCFG1_RTSECSEL_POSN                    equ 0001h
PADCFG1_RTSECSEL_POSITION                equ 0001h
PADCFG1_RTSECSEL_SIZE                    equ 0002h
PADCFG1_RTSECSEL_LENGTH                  equ 0002h
PADCFG1_RTSECSEL_MASK                    equ 0006h
PADCFG1_REPU_POSN                        equ 0006h
PADCFG1_REPU_POSITION                    equ 0006h
PADCFG1_REPU_SIZE                        equ 0001h
PADCFG1_REPU_LENGTH                      equ 0001h
PADCFG1_REPU_MASK                        equ 0040h
PADCFG1_RDPU_POSN                        equ 0007h
PADCFG1_RDPU_POSITION                    equ 0007h
PADCFG1_RDPU_SIZE                        equ 0001h
PADCFG1_RDPU_LENGTH                      equ 0001h
PADCFG1_RDPU_MASK                        equ 0080h
PADCFG1_RTSECSEL0_POSN                   equ 0001h
PADCFG1_RTSECSEL0_POSITION               equ 0001h
PADCFG1_RTSECSEL0_SIZE                   equ 0001h
PADCFG1_RTSECSEL0_LENGTH                 equ 0001h
PADCFG1_RTSECSEL0_MASK                   equ 0002h
PADCFG1_RTSECSEL1_POSN                   equ 0002h
PADCFG1_RTSECSEL1_POSITION               equ 0002h
PADCFG1_RTSECSEL1_SIZE                   equ 0001h
PADCFG1_RTSECSEL1_LENGTH                 equ 0001h
PADCFG1_RTSECSEL1_MASK                   equ 0004h

// Register: CM1CON
#define CM1CON CM1CON
CM1CON                                   equ 0F54h
// bitfield definitions
CM1CON_CCH_POSN                          equ 0000h
CM1CON_CCH_POSITION                      equ 0000h
CM1CON_CCH_SIZE                          equ 0002h
CM1CON_CCH_LENGTH                        equ 0002h
CM1CON_CCH_MASK                          equ 0003h
CM1CON_CREF_POSN                         equ 0002h
CM1CON_CREF_POSITION                     equ 0002h
CM1CON_CREF_SIZE                         equ 0001h
CM1CON_CREF_LENGTH                       equ 0001h
CM1CON_CREF_MASK                         equ 0004h
CM1CON_EVPOL_POSN                        equ 0003h
CM1CON_EVPOL_POSITION                    equ 0003h
CM1CON_EVPOL_SIZE                        equ 0002h
CM1CON_EVPOL_LENGTH                      equ 0002h
CM1CON_EVPOL_MASK                        equ 0018h
CM1CON_CPOL_POSN                         equ 0005h
CM1CON_CPOL_POSITION                     equ 0005h
CM1CON_CPOL_SIZE                         equ 0001h
CM1CON_CPOL_LENGTH                       equ 0001h
CM1CON_CPOL_MASK                         equ 0020h
CM1CON_COE_POSN                          equ 0006h
CM1CON_COE_POSITION                      equ 0006h
CM1CON_COE_SIZE                          equ 0001h
CM1CON_COE_LENGTH                        equ 0001h
CM1CON_COE_MASK                          equ 0040h
CM1CON_CON_POSN                          equ 0007h
CM1CON_CON_POSITION                      equ 0007h
CM1CON_CON_SIZE                          equ 0001h
CM1CON_CON_LENGTH                        equ 0001h
CM1CON_CON_MASK                          equ 0080h
CM1CON_CCH0_POSN                         equ 0000h
CM1CON_CCH0_POSITION                     equ 0000h
CM1CON_CCH0_SIZE                         equ 0001h
CM1CON_CCH0_LENGTH                       equ 0001h
CM1CON_CCH0_MASK                         equ 0001h
CM1CON_CCH1_POSN                         equ 0001h
CM1CON_CCH1_POSITION                     equ 0001h
CM1CON_CCH1_SIZE                         equ 0001h
CM1CON_CCH1_LENGTH                       equ 0001h
CM1CON_CCH1_MASK                         equ 0002h
CM1CON_EVPOL0_POSN                       equ 0003h
CM1CON_EVPOL0_POSITION                   equ 0003h
CM1CON_EVPOL0_SIZE                       equ 0001h
CM1CON_EVPOL0_LENGTH                     equ 0001h
CM1CON_EVPOL0_MASK                       equ 0008h
CM1CON_EVPOL1_POSN                       equ 0004h
CM1CON_EVPOL1_POSITION                   equ 0004h
CM1CON_EVPOL1_SIZE                       equ 0001h
CM1CON_EVPOL1_LENGTH                     equ 0001h
CM1CON_EVPOL1_MASK                       equ 0010h
CM1CON_C1CH0_POSN                        equ 0000h
CM1CON_C1CH0_POSITION                    equ 0000h
CM1CON_C1CH0_SIZE                        equ 0001h
CM1CON_C1CH0_LENGTH                      equ 0001h
CM1CON_C1CH0_MASK                        equ 0001h
CM1CON_C1CH1_POSN                        equ 0001h
CM1CON_C1CH1_POSITION                    equ 0001h
CM1CON_C1CH1_SIZE                        equ 0001h
CM1CON_C1CH1_LENGTH                      equ 0001h
CM1CON_C1CH1_MASK                        equ 0002h
CM1CON_CREF1_POSN                        equ 0002h
CM1CON_CREF1_POSITION                    equ 0002h
CM1CON_CREF1_SIZE                        equ 0001h
CM1CON_CREF1_LENGTH                      equ 0001h
CM1CON_CREF1_MASK                        equ 0004h
CM1CON_EVPOL01_POSN                      equ 0003h
CM1CON_EVPOL01_POSITION                  equ 0003h
CM1CON_EVPOL01_SIZE                      equ 0001h
CM1CON_EVPOL01_LENGTH                    equ 0001h
CM1CON_EVPOL01_MASK                      equ 0008h
CM1CON_EVPOL11_POSN                      equ 0004h
CM1CON_EVPOL11_POSITION                  equ 0004h
CM1CON_EVPOL11_SIZE                      equ 0001h
CM1CON_EVPOL11_LENGTH                    equ 0001h
CM1CON_EVPOL11_MASK                      equ 0010h
CM1CON_CPOL1_POSN                        equ 0005h
CM1CON_CPOL1_POSITION                    equ 0005h
CM1CON_CPOL1_SIZE                        equ 0001h
CM1CON_CPOL1_LENGTH                      equ 0001h
CM1CON_CPOL1_MASK                        equ 0020h
CM1CON_COE1_POSN                         equ 0006h
CM1CON_COE1_POSITION                     equ 0006h
CM1CON_COE1_SIZE                         equ 0001h
CM1CON_COE1_LENGTH                       equ 0001h
CM1CON_COE1_MASK                         equ 0040h
CM1CON_CON1_POSN                         equ 0007h
CM1CON_CON1_POSITION                     equ 0007h
CM1CON_CON1_SIZE                         equ 0001h
CM1CON_CON1_LENGTH                       equ 0001h
CM1CON_CON1_MASK                         equ 0080h
CM1CON_CCH01_POSN                        equ 0000h
CM1CON_CCH01_POSITION                    equ 0000h
CM1CON_CCH01_SIZE                        equ 0001h
CM1CON_CCH01_LENGTH                      equ 0001h
CM1CON_CCH01_MASK                        equ 0001h
CM1CON_CCH11_POSN                        equ 0001h
CM1CON_CCH11_POSITION                    equ 0001h
CM1CON_CCH11_SIZE                        equ 0001h
CM1CON_CCH11_LENGTH                      equ 0001h
CM1CON_CCH11_MASK                        equ 0002h

