GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
LCDDATA4                                 equ 0F6Ah
// bitfield definitions
LCDDATA4_S32C0_POSN                      equ 0000h
LCDDATA4_S32C0_POSITION                  equ 0000h
LCDDATA4_S32C0_SIZE                      equ 0001h
LCDDATA4_S32C0_LENGTH                    equ 0001h
LCDDATA4_S32C0_MASK                      equ 0001h

// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 0F6Ch
// bitfield definitions
LCDDATA6_S00C1_POSN                      equ 0000h
LCDDATA6_S00C1_POSITION                  equ 0000h
LCDDATA6_S00C1_SIZE                      equ 0001h
LCDDATA6_S00C1_LENGTH                    equ 0001h
LCDDATA6_S00C1_MASK                      equ 0001h
LCDDATA6_S01C1_POSN                      equ 0001h
LCDDATA6_S01C1_POSITION                  equ 0001h
LCDDATA6_S01C1_SIZE                      equ 0001h
LCDDATA6_S01C1_LENGTH                    equ 0001h
LCDDATA6_S01C1_MASK                      equ 0002h
LCDDATA6_S02C1_POSN                      equ 0002h
LCDDATA6_S02C1_POSITION                  equ 0002h
LCDDATA6_S02C1_SIZE                      equ 0001h
LCDDATA6_S02C1_LENGTH                    equ 0001h
LCDDATA6_S02C1_MASK                      equ 0004h
LCDDATA6_S03C1_POSN                      equ 0003h
LCDDATA6_S03C1_POSITION                  equ 0003h
LCDDATA6_S03C1_SIZE                      equ 0001h
LCDDATA6_S03C1_LENGTH                    equ 0001h
LCDDATA6_S03C1_MASK                      equ 0008h
LCDDATA6_S04C1_POSN                      equ 0004h
LCDDATA6_S04C1_POSITION                  equ 0004h
LCDDATA6_S04C1_SIZE                      equ 0001h
LCDDATA6_S04C1_LENGTH                    equ 0001h
LCDDATA6_S04C1_MASK                      equ 0010h
LCDDATA6_S05C1_POSN                      equ 0005h
LCDDATA6_S05C1_POSITION                  equ 0005h
LCDDATA6_S05C1_SIZE                      equ 0001h
LCDDATA6_S05C1_LENGTH                    equ 0001h
LCDDATA6_S05C1_MASK                      equ 0020h
LCDDATA6_S06C1_POSN                      equ 0006h
LCDDATA6_S06C1_POSITION                  equ 0006h
LCDDATA6_S06C1_SIZE                      equ 0001h
LCDDATA6_S06C1_LENGTH                    equ 0001h
LCDDATA6_S06C1_MASK                      equ 0040h
LCDDATA6_S07C1_POSN                      equ 0007h
LCDDATA6_S07C1_POSITION                  equ 0007h
LCDDATA6_S07C1_SIZE                      equ 0001h
LCDDATA6_S07C1_LENGTH                    equ 0001h
LCDDATA6_S07C1_MASK                      equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 0F6Dh
// bitfield definitions
LCDDATA7_S08C1_POSN                      equ 0000h
LCDDATA7_S08C1_POSITION                  equ 0000h
LCDDATA7_S08C1_SIZE                      equ 0001h
LCDDATA7_S08C1_LENGTH                    equ 0001h
LCDDATA7_S08C1_MASK                      equ 0001h
LCDDATA7_S09C1_POSN                      equ 0001h
LCDDATA7_S09C1_POSITION                  equ 0001h
LCDDATA7_S09C1_SIZE                      equ 0001h
LCDDATA7_S09C1_LENGTH                    equ 0001h
LCDDATA7_S09C1_MASK                      equ 0002h
LCDDATA7_S10C1_POSN                      equ 0002h
LCDDATA7_S10C1_POSITION                  equ 0002h
LCDDATA7_S10C1_SIZE                      equ 0001h
LCDDATA7_S10C1_LENGTH                    equ 0001h
LCDDATA7_S10C1_MASK                      equ 0004h
LCDDATA7_S11C1_POSN                      equ 0003h
LCDDATA7_S11C1_POSITION                  equ 0003h
LCDDATA7_S11C1_SIZE                      equ 0001h
LCDDATA7_S11C1_LENGTH                    equ 0001h
LCDDATA7_S11C1_MASK                      equ 0008h
LCDDATA7_S12C1_POSN                      equ 0004h
LCDDATA7_S12C1_POSITION                  equ 0004h
LCDDATA7_S12C1_SIZE                      equ 0001h
LCDDATA7_S12C1_LENGTH                    equ 0001h
LCDDATA7_S12C1_MASK                      equ 0010h
LCDDATA7_S13C1_POSN                      equ 0005h
LCDDATA7_S13C1_POSITION                  equ 0005h
LCDDATA7_S13C1_SIZE                      equ 0001h
LCDDATA7_S13C1_LENGTH                    equ 0001h
LCDDATA7_S13C1_MASK                      equ 0020h
LCDDATA7_S14C1_POSN                      equ 0006h
LCDDATA7_S14C1_POSITION                  equ 0006h
LCDDATA7_S14C1_SIZE                      equ 0001h
LCDDATA7_S14C1_LENGTH                    equ 0001h
LCDDATA7_S14C1_MASK                      equ 0040h
LCDDATA7_S15C1_POSN                      equ 0007h
LCDDATA7_S15C1_POSITION                  equ 0007h
LCDDATA7_S15C1_SIZE                      equ 0001h
LCDDATA7_S15C1_LENGTH                    equ 0001h
LCDDATA7_S15C1_MASK                      equ 0080h

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
LCDDATA8                                 equ 0F6Eh
// bitfield definitions
LCDDATA8_S16C1_POSN                      equ 0000h
LCDDATA8_S16C1_POSITION                  equ 0000h
LCDDATA8_S16C1_SIZE                      equ 0001h
LCDDATA8_S16C1_LENGTH                    equ 0001h
LCDDATA8_S16C1_MASK                      equ 0001h
LCDDATA8_S17C1_POSN                      equ 0001h
LCDDATA8_S17C1_POSITION                  equ 0001h
LCDDATA8_S17C1_SIZE                      equ 0001h
LCDDATA8_S17C1_LENGTH                    equ 0001h
LCDDATA8_S17C1_MASK                      equ 0002h
LCDDATA8_S18C1_POSN                      equ 0002h
LCDDATA8_S18C1_POSITION                  equ 0002h
LCDDATA8_S18C1_SIZE                      equ 0001h
LCDDATA8_S18C1_LENGTH                    equ 0001h
LCDDATA8_S18C1_MASK                      equ 0004h
LCDDATA8_S19C1_POSN                      equ 0003h
LCDDATA8_S19C1_POSITION                  equ 0003h
LCDDATA8_S19C1_SIZE                      equ 0001h
LCDDATA8_S19C1_LENGTH                    equ 0001h
LCDDATA8_S19C1_MASK                      equ 0008h
LCDDATA8_S20C1_POSN                      equ 0004h
LCDDATA8_S20C1_POSITION                  equ 0004h
LCDDATA8_S20C1_SIZE                      equ 0001h
LCDDATA8_S20C1_LENGTH                    equ 0001h
LCDDATA8_S20C1_MASK                      equ 0010h
LCDDATA8_S21C1_POSN                      equ 0005h
LCDDATA8_S21C1_POSITION                  equ 0005h
LCDDATA8_S21C1_SIZE                      equ 0001h
LCDDATA8_S21C1_LENGTH                    equ 0001h
LCDDATA8_S21C1_MASK                      equ 0020h
LCDDATA8_S22C1_POSN                      equ 0006h
LCDDATA8_S22C1_POSITION                  equ 0006h
LCDDATA8_S22C1_SIZE                      equ 0001h
LCDDATA8_S22C1_LENGTH                    equ 0001h
LCDDATA8_S22C1_MASK                      equ 0040h
LCDDATA8_S23C1_POSN                      equ 0007h
LCDDATA8_S23C1_POSITION                  equ 0007h
LCDDATA8_S23C1_SIZE                      equ 0001h
LCDDATA8_S23C1_LENGTH                    equ 0001h
LCDDATA8_S23C1_MASK                      equ 0080h

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 0F6Fh
// bitfield definitions
LCDDATA9_S24C1_POSN                      equ 0000h
LCDDATA9_S24C1_POSITION                  equ 0000h
LCDDATA9_S24C1_SIZE                      equ 0001h
LCDDATA9_S24C1_LENGTH                    equ 0001h
LCDDATA9_S24C1_MASK                      equ 0001h
LCDDATA9_S25C1_POSN                      equ 0001h
LCDDATA9_S25C1_POSITION                  equ 0001h
LCDDATA9_S25C1_SIZE                      equ 0001h
LCDDATA9_S25C1_LENGTH                    equ 0001h
LCDDATA9_S25C1_MASK                      equ 0002h
LCDDATA9_S26C1_POSN                      equ 0002h
LCDDATA9_S26C1_POSITION                  equ 0002h
LCDDATA9_S26C1_SIZE                      equ 0001h
LCDDATA9_S26C1_LENGTH                    equ 0001h
LCDDATA9_S26C1_MASK                      equ 0004h
LCDDATA9_S27C1_POSN                      equ 0003h
LCDDATA9_S27C1_POSITION                  equ 0003h
LCDDATA9_S27C1_SIZE                      equ 0001h
LCDDATA9_S27C1_LENGTH                    equ 0001h
LCDDATA9_S27C1_MASK                      equ 0008h
LCDDATA9_S28C1_POSN                      equ 0004h
LCDDATA9_S28C1_POSITION                  equ 0004h
LCDDATA9_S28C1_SIZE                      equ 0001h
LCDDATA9_S28C1_LENGTH                    equ 0001h
LCDDATA9_S28C1_MASK                      equ 0010h
LCDDATA9_S29C1_POSN                      equ 0005h
LCDDATA9_S29C1_POSITION                  equ 0005h
LCDDATA9_S29C1_SIZE                      equ 0001h
LCDDATA9_S29C1_LENGTH                    equ 0001h
LCDDATA9_S29C1_MASK                      equ 0020h
LCDDATA9_S30C1_POSN                      equ 0006h
LCDDATA9_S30C1_POSITION                  equ 0006h
LCDDATA9_S30C1_SIZE                      equ 0001h
LCDDATA9_S30C1_LENGTH                    equ 0001h
LCDDATA9_S30C1_MASK                      equ 0040h
LCDDATA9_S31C1_POSN                      equ 0007h
LCDDATA9_S31C1_POSITION                  equ 0007h
LCDDATA9_S31C1_SIZE                      equ 0001h
LCDDATA9_S31C1_LENGTH                    equ 0001h
LCDDATA9_S31C1_MASK                      equ 0080h

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 0F70h
// bitfield definitions
LCDDATA10_S32C1_POSN                     equ 0000h
LCDDATA10_S32C1_POSITION                 equ 0000h
LCDDATA10_S32C1_SIZE                     equ 0001h
LCDDATA10_S32C1_LENGTH                   equ 0001h
LCDDATA10_S32C1_MASK                     equ 0001h

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 0F72h
// bitfield definitions
LCDDATA12_S00C2_POSN                     equ 0000h
LCDDATA12_S00C2_POSITION                 equ 0000h
LCDDATA12_S00C2_SIZE                     equ 0001h
LCDDATA12_S00C2_LENGTH                   equ 0001h
LCDDATA12_S00C2_MASK                     equ 0001h
LCDDATA12_S01C2_POSN                     equ 0001h
LCDDATA12_S01C2_POSITION                 equ 0001h
LCDDATA12_S01C2_SIZE                     equ 0001h
LCDDATA12_S01C2_LENGTH                   equ 0001h
LCDDATA12_S01C2_MASK                     equ 0002h
LCDDATA12_S02C2_POSN                     equ 0002h
LCDDATA12_S02C2_POSITION                 equ 0002h
LCDDATA12_S02C2_SIZE                     equ 0001h
LCDDATA12_S02C2_LENGTH                   equ 0001h
LCDDATA12_S02C2_MASK                     equ 0004h
LCDDATA12_S03C2_POSN                     equ 0003h
LCDDATA12_S03C2_POSITION                 equ 0003h
LCDDATA12_S03C2_SIZE                     equ 0001h
LCDDATA12_S03C2_LENGTH                   equ 0001h
LCDDATA12_S03C2_MASK                     equ 0008h
LCDDATA12_S04C2_POSN                     equ 0004h
LCDDATA12_S04C2_POSITION                 equ 0004h
LCDDATA12_S04C2_SIZE                     equ 0001h
LCDDATA12_S04C2_LENGTH                   equ 0001h
LCDDATA12_S04C2_MASK                     equ 0010h
LCDDATA12_S05C2_POSN                     equ 0005h
LCDDATA12_S05C2_POSITION                 equ 0005h
LCDDATA12_S05C2_SIZE                     equ 0001h
LCDDATA12_S05C2_LENGTH                   equ 0001h
LCDDATA12_S05C2_MASK                     equ 0020h
LCDDATA12_S06C2_POSN                     equ 0006h
LCDDATA12_S06C2_POSITION                 equ 0006h
LCDDATA12_S06C2_SIZE                     equ 0001h
LCDDATA12_S06C2_LENGTH                   equ 0001h
LCDDATA12_S06C2_MASK                     equ 0040h
LCDDATA12_S07C2_POSN                     equ 0007h
LCDDATA12_S07C2_POSITION                 equ 0007h
LCDDATA12_S07C2_SIZE                     equ 0001h
LCDDATA12_S07C2_LENGTH                   equ 0001h
LCDDATA12_S07C2_MASK                     equ 0080h
LCDDATA12_SSPM012_POSN                   equ 0000h
LCDDATA12_SSPM012_POSITION               equ 0000h
LCDDATA12_SSPM012_SIZE                   equ 0001h
LCDDATA12_SSPM012_LENGTH                 equ 0001h
LCDDATA12_SSPM012_MASK                   equ 0001h
LCDDATA12_SSPM112_POSN                   equ 0001h
LCDDATA12_SSPM112_POSITION               equ 0001h
LCDDATA12_SSPM112_SIZE                   equ 0001h
LCDDATA12_SSPM112_LENGTH                 equ 0001h
LCDDATA12_SSPM112_MASK                   equ 0002h
LCDDATA12_SSPM212_POSN                   equ 0002h
LCDDATA12_SSPM212_POSITION               equ 0002h
LCDDATA12_SSPM212_SIZE                   equ 0001h
LCDDATA12_SSPM212_LENGTH                 equ 0001h
LCDDATA12_SSPM212_MASK                   equ 0004h
LCDDATA12_SSPM312_POSN                   equ 0003h
LCDDATA12_SSPM312_POSITION               equ 0003h
LCDDATA12_SSPM312_SIZE                   equ 0001h
LCDDATA12_SSPM312_LENGTH                 equ 0001h
LCDDATA12_SSPM312_MASK                   equ 0008h

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 0F73h
// bitfield definitions
LCDDATA13_S08C2_POSN                     equ 0000h
LCDDATA13_S08C2_POSITION                 equ 0000h
LCDDATA13_S08C2_SIZE                     equ 0001h
LCDDATA13_S08C2_LENGTH                   equ 0001h
LCDDATA13_S08C2_MASK                     equ 0001h
LCDDATA13_S09C2_POSN                     equ 0001h
LCDDATA13_S09C2_POSITION                 equ 0001h
LCDDATA13_S09C2_SIZE                     equ 0001h
LCDDATA13_S09C2_LENGTH                   equ 0001h
LCDDATA13_S09C2_MASK                     equ 0002h
LCDDATA13_S10C2_POSN                     equ 0002h
LCDDATA13_S10C2_POSITION                 equ 0002h
LCDDATA13_S10C2_SIZE                     equ 0001h
LCDDATA13_S10C2_LENGTH                   equ 0001h
LCDDATA13_S10C2_MASK                     equ 0004h
LCDDATA13_S11C2_POSN                     equ 0003h
LCDDATA13_S11C2_POSITION                 equ 0003h
LCDDATA13_S11C2_SIZE                     equ 0001h
LCDDATA13_S11C2_LENGTH                   equ 0001h
LCDDATA13_S11C2_MASK                     equ 0008h
LCDDATA13_S12C2_POSN                     equ 0004h
LCDDATA13_S12C2_POSITION                 equ 0004h
LCDDATA13_S12C2_SIZE                     equ 0001h
LCDDATA13_S12C2_LENGTH                   equ 0001h
LCDDATA13_S12C2_MASK                     equ 0010h
LCDDATA13_S13C2_POSN                     equ 0005h
LCDDATA13_S13C2_POSITION                 equ 0005h
LCDDATA13_S13C2_SIZE                     equ 0001h
LCDDATA13_S13C2_LENGTH                   equ 0001h
LCDDATA13_S13C2_MASK                     equ 0020h
LCDDATA13_S14C2_POSN                     equ 0006h
LCDDATA13_S14C2_POSITION                 equ 0006h
LCDDATA13_S14C2_SIZE                     equ 0001h
LCDDATA13_S14C2_LENGTH                   equ 0001h
LCDDATA13_S14C2_MASK                     equ 0040h
LCDDATA13_S15C2_POSN                     equ 0007h
LCDDATA13_S15C2_POSITION                 equ 0007h
LCDDATA13_S15C2_SIZE                     equ 0001h
LCDDATA13_S15C2_LENGTH                   equ 0001h
LCDDATA13_S15C2_MASK                     equ 0080h

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 0F74h
// bitfield definitions
LCDDATA14_S16C2_POSN                     equ 0000h
LCDDATA14_S16C2_POSITION                 equ 0000h
LCDDATA14_S16C2_SIZE                     equ 0001h
LCDDATA14_S16C2_LENGTH                   equ 0001h
LCDDATA14_S16C2_MASK                     equ 0001h
LCDDATA14_S17C2_POSN                     equ 0001h
LCDDATA14_S17C2_POSITION                 equ 0001h
LCDDATA14_S17C2_SIZE                     equ 0001h
LCDDATA14_S17C2_LENGTH                   equ 0001h
LCDDATA14_S17C2_MASK                     equ 0002h
LCDDATA14_S18C2_POSN                     equ 0002h
LCDDATA14_S18C2_POSITION                 equ 0002h
LCDDATA14_S18C2_SIZE                     equ 0001h
LCDDATA14_S18C2_LENGTH                   equ 0001h
LCDDATA14_S18C2_MASK                     equ 0004h
LCDDATA14_S19C2_POSN                     equ 0003h
LCDDATA14_S19C2_POSITION                 equ 0003h
LCDDATA14_S19C2_SIZE                     equ 0001h
LCDDATA14_S19C2_LENGTH                   equ 0001h
LCDDATA14_S19C2_MASK                     equ 0008h
LCDDATA14_S20C2_POSN                     equ 0004h
LCDDATA14_S20C2_POSITION                 equ 0004h
LCDDATA14_S20C2_SIZE                     equ 0001h
LCDDATA14_S20C2_LENGTH                   equ 0001h
LCDDATA14_S20C2_MASK                     equ 0010h
LCDDATA14_S21C2_POSN                     equ 0005h
LCDDATA14_S21C2_POSITION                 equ 0005h
LCDDATA14_S21C2_SIZE                     equ 0001h
LCDDATA14_S21C2_LENGTH                   equ 0001h
LCDDATA14_S21C2_MASK                     equ 0020h
LCDDATA14_S22C2_POSN                     equ 0006h
LCDDATA14_S22C2_POSITION                 equ 0006h
LCDDATA14_S22C2_SIZE                     equ 0001h
LCDDATA14_S22C2_LENGTH                   equ 0001h
LCDDATA14_S22C2_MASK                     equ 0040h
LCDDATA14_S23C2_POSN                     equ 0007h
LCDDATA14_S23C2_POSITION                 equ 0007h
LCDDATA14_S23C2_SIZE                     equ 0001h
LCDDATA14_S23C2_LENGTH                   equ 0001h
LCDDATA14_S23C2_MASK                     equ 0080h
LCDDATA14_MSK0_POSN                      equ 0000h
LCDDATA14_MSK0_POSITION                  equ 0000h
LCDDATA14_MSK0_SIZE                      equ 0001h
LCDDATA14_MSK0_LENGTH                    equ 0001h
LCDDATA14_MSK0_MASK                      equ 0001h
LCDDATA14_MSK1_POSN                      equ 0001h
LCDDATA14_MSK1_POSITION                  equ 0001h
LCDDATA14_MSK1_SIZE                      equ 0001h
LCDDATA14_MSK1_LENGTH                    equ 0001h
LCDDATA14_MSK1_MASK                      equ 0002h
LCDDATA14_MSK2_POSN                      equ 0002h
LCDDATA14_MSK2_POSITION                  equ 0002h
LCDDATA14_MSK2_SIZE                      equ 0001h
LCDDATA14_MSK2_LENGTH                    equ 0001h
LCDDATA14_MSK2_MASK                      equ 0004h
LCDDATA14_MSK3_POSN                      equ 0003h
LCDDATA14_MSK3_POSITION                  equ 0003h
LCDDATA14_MSK3_SIZE                      equ 0001h
LCDDATA14_MSK3_LENGTH                    equ 0001h
LCDDATA14_MSK3_MASK                      equ 0008h
LCDDATA14_MSK4_POSN                      equ 0004h
LCDDATA14_MSK4_POSITION                  equ 0004h
LCDDATA14_MSK4_SIZE                      equ 0001h
LCDDATA14_MSK4_LENGTH                    equ 0001h
LCDDATA14_MSK4_MASK                      equ 0010h
LCDDATA14_MSK5_POSN                      equ 0005h
LCDDATA14_MSK5_POSITION                  equ 0005h
LCDDATA14_MSK5_SIZE                      equ 0001h
LCDDATA14_MSK5_LENGTH                    equ 0001h
LCDDATA14_MSK5_MASK                      equ 0020h
LCDDATA14_MSK6_POSN                      equ 0006h
LCDDATA14_MSK6_POSITION                  equ 0006h
LCDDATA14_MSK6_SIZE                      equ 0001h
LCDDATA14_MSK6_LENGTH                    equ 0001h
LCDDATA14_MSK6_MASK                      equ 0040h
LCDDATA14_MSK7_POSN                      equ 0007h
LCDDATA14_MSK7_POSITION                  equ 0007h
LCDDATA14_MSK7_SIZE                      equ 0001h
LCDDATA14_MSK7_LENGTH                    equ 0001h
LCDDATA14_MSK7_MASK                      equ 0080h

