GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
LCDDATA15                                equ 0F75h
// bitfield definitions
LCDDATA15_S24C2_POSN                     equ 0000h
LCDDATA15_S24C2_POSITION                 equ 0000h
LCDDATA15_S24C2_SIZE                     equ 0001h
LCDDATA15_S24C2_LENGTH                   equ 0001h
LCDDATA15_S24C2_MASK                     equ 0001h
LCDDATA15_S25C2_POSN                     equ 0001h
LCDDATA15_S25C2_POSITION                 equ 0001h
LCDDATA15_S25C2_SIZE                     equ 0001h
LCDDATA15_S25C2_LENGTH                   equ 0001h
LCDDATA15_S25C2_MASK                     equ 0002h
LCDDATA15_S26C2_POSN                     equ 0002h
LCDDATA15_S26C2_POSITION                 equ 0002h
LCDDATA15_S26C2_SIZE                     equ 0001h
LCDDATA15_S26C2_LENGTH                   equ 0001h
LCDDATA15_S26C2_MASK                     equ 0004h
LCDDATA15_S27C2_POSN                     equ 0003h
LCDDATA15_S27C2_POSITION                 equ 0003h
LCDDATA15_S27C2_SIZE                     equ 0001h
LCDDATA15_S27C2_LENGTH                   equ 0001h
LCDDATA15_S27C2_MASK                     equ 0008h
LCDDATA15_S28C2_POSN                     equ 0004h
LCDDATA15_S28C2_POSITION                 equ 0004h
LCDDATA15_S28C2_SIZE                     equ 0001h
LCDDATA15_S28C2_LENGTH                   equ 0001h
LCDDATA15_S28C2_MASK                     equ 0010h
LCDDATA15_S29C2_POSN                     equ 0005h
LCDDATA15_S29C2_POSITION                 equ 0005h
LCDDATA15_S29C2_SIZE                     equ 0001h
LCDDATA15_S29C2_LENGTH                   equ 0001h
LCDDATA15_S29C2_MASK                     equ 0020h
LCDDATA15_S30C2_POSN                     equ 0006h
LCDDATA15_S30C2_POSITION                 equ 0006h
LCDDATA15_S30C2_SIZE                     equ 0001h
LCDDATA15_S30C2_LENGTH                   equ 0001h
LCDDATA15_S30C2_MASK                     equ 0040h
LCDDATA15_S31C2_POSN                     equ 0007h
LCDDATA15_S31C2_POSITION                 equ 0007h
LCDDATA15_S31C2_SIZE                     equ 0001h
LCDDATA15_S31C2_LENGTH                   equ 0001h
LCDDATA15_S31C2_MASK                     equ 0080h

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
LCDDATA16                                equ 0F76h
// bitfield definitions
LCDDATA16_S32C2_POSN                     equ 0000h
LCDDATA16_S32C2_POSITION                 equ 0000h
LCDDATA16_S32C2_SIZE                     equ 0001h
LCDDATA16_S32C2_LENGTH                   equ 0001h
LCDDATA16_S32C2_MASK                     equ 0001h
LCDDATA16_T4CKPS016_POSN                 equ 0000h
LCDDATA16_T4CKPS016_POSITION             equ 0000h
LCDDATA16_T4CKPS016_SIZE                 equ 0001h
LCDDATA16_T4CKPS016_LENGTH               equ 0001h
LCDDATA16_T4CKPS016_MASK                 equ 0001h

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
LCDDATA18                                equ 0F78h
// bitfield definitions
LCDDATA18_S00C3_POSN                     equ 0000h
LCDDATA18_S00C3_POSITION                 equ 0000h
LCDDATA18_S00C3_SIZE                     equ 0001h
LCDDATA18_S00C3_LENGTH                   equ 0001h
LCDDATA18_S00C3_MASK                     equ 0001h
LCDDATA18_S01C3_POSN                     equ 0001h
LCDDATA18_S01C3_POSITION                 equ 0001h
LCDDATA18_S01C3_SIZE                     equ 0001h
LCDDATA18_S01C3_LENGTH                   equ 0001h
LCDDATA18_S01C3_MASK                     equ 0002h
LCDDATA18_S02C3_POSN                     equ 0002h
LCDDATA18_S02C3_POSITION                 equ 0002h
LCDDATA18_S02C3_SIZE                     equ 0001h
LCDDATA18_S02C3_LENGTH                   equ 0001h
LCDDATA18_S02C3_MASK                     equ 0004h
LCDDATA18_S03C3_POSN                     equ 0003h
LCDDATA18_S03C3_POSITION                 equ 0003h
LCDDATA18_S03C3_SIZE                     equ 0001h
LCDDATA18_S03C3_LENGTH                   equ 0001h
LCDDATA18_S03C3_MASK                     equ 0008h
LCDDATA18_S04C3_POSN                     equ 0004h
LCDDATA18_S04C3_POSITION                 equ 0004h
LCDDATA18_S04C3_SIZE                     equ 0001h
LCDDATA18_S04C3_LENGTH                   equ 0001h
LCDDATA18_S04C3_MASK                     equ 0010h
LCDDATA18_S05C3_POSN                     equ 0005h
LCDDATA18_S05C3_POSITION                 equ 0005h
LCDDATA18_S05C3_SIZE                     equ 0001h
LCDDATA18_S05C3_LENGTH                   equ 0001h
LCDDATA18_S05C3_MASK                     equ 0020h
LCDDATA18_S06C3_POSN                     equ 0006h
LCDDATA18_S06C3_POSITION                 equ 0006h
LCDDATA18_S06C3_SIZE                     equ 0001h
LCDDATA18_S06C3_LENGTH                   equ 0001h
LCDDATA18_S06C3_MASK                     equ 0040h
LCDDATA18_S07C3_POSN                     equ 0007h
LCDDATA18_S07C3_POSITION                 equ 0007h
LCDDATA18_S07C3_SIZE                     equ 0001h
LCDDATA18_S07C3_LENGTH                   equ 0001h
LCDDATA18_S07C3_MASK                     equ 0080h

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
LCDDATA19                                equ 0F79h
// bitfield definitions
LCDDATA19_S08C3_POSN                     equ 0000h
LCDDATA19_S08C3_POSITION                 equ 0000h
LCDDATA19_S08C3_SIZE                     equ 0001h
LCDDATA19_S08C3_LENGTH                   equ 0001h
LCDDATA19_S08C3_MASK                     equ 0001h
LCDDATA19_S09C3_POSN                     equ 0001h
LCDDATA19_S09C3_POSITION                 equ 0001h
LCDDATA19_S09C3_SIZE                     equ 0001h
LCDDATA19_S09C3_LENGTH                   equ 0001h
LCDDATA19_S09C3_MASK                     equ 0002h
LCDDATA19_S10C3_POSN                     equ 0002h
LCDDATA19_S10C3_POSITION                 equ 0002h
LCDDATA19_S10C3_SIZE                     equ 0001h
LCDDATA19_S10C3_LENGTH                   equ 0001h
LCDDATA19_S10C3_MASK                     equ 0004h
LCDDATA19_S11C3_POSN                     equ 0003h
LCDDATA19_S11C3_POSITION                 equ 0003h
LCDDATA19_S11C3_SIZE                     equ 0001h
LCDDATA19_S11C3_LENGTH                   equ 0001h
LCDDATA19_S11C3_MASK                     equ 0008h
LCDDATA19_S12C3_POSN                     equ 0004h
LCDDATA19_S12C3_POSITION                 equ 0004h
LCDDATA19_S12C3_SIZE                     equ 0001h
LCDDATA19_S12C3_LENGTH                   equ 0001h
LCDDATA19_S12C3_MASK                     equ 0010h
LCDDATA19_S13C3_POSN                     equ 0005h
LCDDATA19_S13C3_POSITION                 equ 0005h
LCDDATA19_S13C3_SIZE                     equ 0001h
LCDDATA19_S13C3_LENGTH                   equ 0001h
LCDDATA19_S13C3_MASK                     equ 0020h
LCDDATA19_S14C3_POSN                     equ 0006h
LCDDATA19_S14C3_POSITION                 equ 0006h
LCDDATA19_S14C3_SIZE                     equ 0001h
LCDDATA19_S14C3_LENGTH                   equ 0001h
LCDDATA19_S14C3_MASK                     equ 0040h
LCDDATA19_S15C3_POSN                     equ 0007h
LCDDATA19_S15C3_POSITION                 equ 0007h
LCDDATA19_S15C3_SIZE                     equ 0001h
LCDDATA19_S15C3_LENGTH                   equ 0001h
LCDDATA19_S15C3_MASK                     equ 0080h
LCDDATA19_T3CKPS019_POSN                 equ 0004h
LCDDATA19_T3CKPS019_POSITION             equ 0004h
LCDDATA19_T3CKPS019_SIZE                 equ 0001h
LCDDATA19_T3CKPS019_LENGTH               equ 0001h
LCDDATA19_T3CKPS019_MASK                 equ 0010h
LCDDATA19_T3CKPS119_POSN                 equ 0005h
LCDDATA19_T3CKPS119_POSITION             equ 0005h
LCDDATA19_T3CKPS119_SIZE                 equ 0001h
LCDDATA19_T3CKPS119_LENGTH               equ 0001h
LCDDATA19_T3CKPS119_MASK                 equ 0020h
LCDDATA19_TMR3CS019_POSN                 equ 0006h
LCDDATA19_TMR3CS019_POSITION             equ 0006h
LCDDATA19_TMR3CS019_SIZE                 equ 0001h
LCDDATA19_TMR3CS019_LENGTH               equ 0001h
LCDDATA19_TMR3CS019_MASK                 equ 0040h
LCDDATA19_TMR3CS119_POSN                 equ 0007h
LCDDATA19_TMR3CS119_POSITION             equ 0007h
LCDDATA19_TMR3CS119_SIZE                 equ 0001h
LCDDATA19_TMR3CS119_LENGTH               equ 0001h
LCDDATA19_TMR3CS119_MASK                 equ 0080h

