GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0F82h
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h
PORTC_SEG32_POSN                         equ 0001h
PORTC_SEG32_POSITION                     equ 0001h
PORTC_SEG32_SIZE                         equ 0001h
PORTC_SEG32_LENGTH                       equ 0001h
PORTC_SEG32_MASK                         equ 0002h
PORTC_SEG13_POSN                         equ 0002h
PORTC_SEG13_POSITION                     equ 0002h
PORTC_SEG13_SIZE                         equ 0001h
PORTC_SEG13_LENGTH                       equ 0001h
PORTC_SEG13_MASK                         equ 0004h
PORTC_SEG17_POSN                         equ 0003h
PORTC_SEG17_POSITION                     equ 0003h
PORTC_SEG17_SIZE                         equ 0001h
PORTC_SEG17_LENGTH                       equ 0001h
PORTC_SEG17_MASK                         equ 0008h
PORTC_SEG16_POSN                         equ 0004h
PORTC_SEG16_POSITION                     equ 0004h
PORTC_SEG16_SIZE                         equ 0001h
PORTC_SEG16_LENGTH                       equ 0001h
PORTC_SEG16_MASK                         equ 0010h
PORTC_SEG12_POSN                         equ 0005h
PORTC_SEG12_POSITION                     equ 0005h
PORTC_SEG12_SIZE                         equ 0001h
PORTC_SEG12_LENGTH                       equ 0001h
PORTC_SEG12_MASK                         equ 0020h
PORTC_SEG27_POSN                         equ 0006h
PORTC_SEG27_POSITION                     equ 0006h
PORTC_SEG27_SIZE                         equ 0001h
PORTC_SEG27_LENGTH                       equ 0001h
PORTC_SEG27_MASK                         equ 0040h
PORTC_SEG28_POSN                         equ 0007h
PORTC_SEG28_POSITION                     equ 0007h
PORTC_SEG28_SIZE                         equ 0001h
PORTC_SEG28_LENGTH                       equ 0001h
PORTC_SEG28_MASK                         equ 0080h
PORTC_SOSCO_POSN                         equ 0000h
PORTC_SOSCO_POSITION                     equ 0000h
PORTC_SOSCO_SIZE                         equ 0001h
PORTC_SOSCO_LENGTH                       equ 0001h
PORTC_SOSCO_MASK                         equ 0001h
PORTC_SOSCI_POSN                         equ 0001h
PORTC_SOSCI_POSITION                     equ 0001h
PORTC_SOSCI_SIZE                         equ 0001h
PORTC_SOSCI_LENGTH                       equ 0001h
PORTC_SOSCI_MASK                         equ 0002h
PORTC_SCK1_POSN                          equ 0003h
PORTC_SCK1_POSITION                      equ 0003h
PORTC_SCK1_SIZE                          equ 0001h
PORTC_SCK1_LENGTH                        equ 0001h
PORTC_SCK1_MASK                          equ 0008h
PORTC_SDI1_POSN                          equ 0004h
PORTC_SDI1_POSITION                      equ 0004h
PORTC_SDI1_SIZE                          equ 0001h
PORTC_SDI1_LENGTH                        equ 0001h
PORTC_SDI1_MASK                          equ 0010h
PORTC_SDO1_POSN                          equ 0005h
PORTC_SDO1_POSITION                      equ 0005h
PORTC_SDO1_SIZE                          equ 0001h
PORTC_SDO1_LENGTH                        equ 0001h
PORTC_SDO1_MASK                          equ 0020h
PORTC_TX1_POSN                           equ 0006h
PORTC_TX1_POSITION                       equ 0006h
PORTC_TX1_SIZE                           equ 0001h
PORTC_TX1_LENGTH                         equ 0001h
PORTC_TX1_MASK                           equ 0040h
PORTC_RX1_POSN                           equ 0007h
PORTC_RX1_POSITION                       equ 0007h
PORTC_RX1_SIZE                           equ 0001h
PORTC_RX1_LENGTH                         equ 0001h
PORTC_RX1_MASK                           equ 0080h
PORTC_SCKLI_POSN                         equ 0000h
PORTC_SCKLI_POSITION                     equ 0000h
PORTC_SCKLI_SIZE                         equ 0001h
PORTC_SCKLI_LENGTH                       equ 0001h
PORTC_SCKLI_MASK                         equ 0001h
PORTC_CCP2_POSN                          equ 0001h
PORTC_CCP2_POSITION                      equ 0001h
PORTC_CCP2_SIZE                          equ 0001h
PORTC_CCP2_LENGTH                        equ 0001h
PORTC_CCP2_MASK                          equ 0002h
PORTC_CCP1_POSN                          equ 0002h
PORTC_CCP1_POSITION                      equ 0002h
PORTC_CCP1_SIZE                          equ 0001h
PORTC_CCP1_LENGTH                        equ 0001h
PORTC_CCP1_MASK                          equ 0004h
PORTC_SCL1_POSN                          equ 0003h
PORTC_SCL1_POSITION                      equ 0003h
PORTC_SCL1_SIZE                          equ 0001h
PORTC_SCL1_LENGTH                        equ 0001h
PORTC_SCL1_MASK                          equ 0008h
PORTC_SDA1_POSN                          equ 0004h
PORTC_SDA1_POSITION                      equ 0004h
PORTC_SDA1_SIZE                          equ 0001h
PORTC_SDA1_LENGTH                        equ 0001h
PORTC_SDA1_MASK                          equ 0010h
PORTC_CK1_POSN                           equ 0006h
PORTC_CK1_POSITION                       equ 0006h
PORTC_CK1_SIZE                           equ 0001h
PORTC_CK1_LENGTH                         equ 0001h
PORTC_CK1_MASK                           equ 0040h
PORTC_DT1_POSN                           equ 0007h
PORTC_DT1_POSITION                       equ 0007h
PORTC_DT1_SIZE                           equ 0001h
PORTC_DT1_LENGTH                         equ 0001h
PORTC_DT1_MASK                           equ 0080h
PORTC_PA2_POSN                           equ 0001h
PORTC_PA2_POSITION                       equ 0001h
PORTC_PA2_SIZE                           equ 0001h
PORTC_PA2_LENGTH                         equ 0001h
PORTC_PA2_MASK                           equ 0002h
PORTC_PA1_POSN                           equ 0002h
PORTC_PA1_POSITION                       equ 0002h
PORTC_PA1_SIZE                           equ 0001h
PORTC_PA1_LENGTH                         equ 0001h
PORTC_PA1_MASK                           equ 0004h

