GopalSaraf/Practicals/PSDL/include/proc/pic18f66k90.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_AD0_POSN                           equ 0000h
PORTD_AD0_POSITION                       equ 0000h
PORTD_AD0_SIZE                           equ 0001h
PORTD_AD0_LENGTH                         equ 0001h
PORTD_AD0_MASK                           equ 0001h
PORTD_AD1_POSN                           equ 0001h
PORTD_AD1_POSITION                       equ 0001h
PORTD_AD1_SIZE                           equ 0001h
PORTD_AD1_LENGTH                         equ 0001h
PORTD_AD1_MASK                           equ 0002h
PORTD_AD2_POSN                           equ 0002h
PORTD_AD2_POSITION                       equ 0002h
PORTD_AD2_SIZE                           equ 0001h
PORTD_AD2_LENGTH                         equ 0001h
PORTD_AD2_MASK                           equ 0004h
PORTD_AD3_POSN                           equ 0003h
PORTD_AD3_POSITION                       equ 0003h
PORTD_AD3_SIZE                           equ 0001h
PORTD_AD3_LENGTH                         equ 0001h
PORTD_AD3_MASK                           equ 0008h
PORTD_AD4_POSN                           equ 0004h
PORTD_AD4_POSITION                       equ 0004h
PORTD_AD4_SIZE                           equ 0001h
PORTD_AD4_LENGTH                         equ 0001h
PORTD_AD4_MASK                           equ 0010h
PORTD_AD5_POSN                           equ 0005h
PORTD_AD5_POSITION                       equ 0005h
PORTD_AD5_SIZE                           equ 0001h
PORTD_AD5_LENGTH                         equ 0001h
PORTD_AD5_MASK                           equ 0020h
PORTD_AD6_POSN                           equ 0006h
PORTD_AD6_POSITION                       equ 0006h
PORTD_AD6_SIZE                           equ 0001h
PORTD_AD6_LENGTH                         equ 0001h
PORTD_AD6_MASK                           equ 0040h
PORTD_AD7_POSN                           equ 0007h
PORTD_AD7_POSITION                       equ 0007h
PORTD_AD7_SIZE                           equ 0001h
PORTD_AD7_LENGTH                         equ 0001h
PORTD_AD7_MASK                           equ 0080h
PORTD_PSP0_POSN                          equ 0000h
PORTD_PSP0_POSITION                      equ 0000h
PORTD_PSP0_SIZE                          equ 0001h
PORTD_PSP0_LENGTH                        equ 0001h
PORTD_PSP0_MASK                          equ 0001h
PORTD_PSP1_POSN                          equ 0001h
PORTD_PSP1_POSITION                      equ 0001h
PORTD_PSP1_SIZE                          equ 0001h
PORTD_PSP1_LENGTH                        equ 0001h
PORTD_PSP1_MASK                          equ 0002h
PORTD_PSP2_POSN                          equ 0002h
PORTD_PSP2_POSITION                      equ 0002h
PORTD_PSP2_SIZE                          equ 0001h
PORTD_PSP2_LENGTH                        equ 0001h
PORTD_PSP2_MASK                          equ 0004h
PORTD_PSP3_POSN                          equ 0003h
PORTD_PSP3_POSITION                      equ 0003h
PORTD_PSP3_SIZE                          equ 0001h
PORTD_PSP3_LENGTH                        equ 0001h
PORTD_PSP3_MASK                          equ 0008h
PORTD_PSP4_POSN                          equ 0004h
PORTD_PSP4_POSITION                      equ 0004h
PORTD_PSP4_SIZE                          equ 0001h
PORTD_PSP4_LENGTH                        equ 0001h
PORTD_PSP4_MASK                          equ 0010h
PORTD_PSP5_POSN                          equ 0005h
PORTD_PSP5_POSITION                      equ 0005h
PORTD_PSP5_SIZE                          equ 0001h
PORTD_PSP5_LENGTH                        equ 0001h
PORTD_PSP5_MASK                          equ 0020h
PORTD_PSP6_POSN                          equ 0006h
PORTD_PSP6_POSITION                      equ 0006h
PORTD_PSP6_SIZE                          equ 0001h
PORTD_PSP6_LENGTH                        equ 0001h
PORTD_PSP6_MASK                          equ 0040h
PORTD_PSP7_POSN                          equ 0007h
PORTD_PSP7_POSITION                      equ 0007h
PORTD_PSP7_SIZE                          equ 0001h
PORTD_PSP7_LENGTH                        equ 0001h
PORTD_PSP7_MASK                          equ 0080h
PORTD_SEG0_POSN                          equ 0000h
PORTD_SEG0_POSITION                      equ 0000h
PORTD_SEG0_SIZE                          equ 0001h
PORTD_SEG0_LENGTH                        equ 0001h
PORTD_SEG0_MASK                          equ 0001h
PORTD_SEG1_POSN                          equ 0001h
PORTD_SEG1_POSITION                      equ 0001h
PORTD_SEG1_SIZE                          equ 0001h
PORTD_SEG1_LENGTH                        equ 0001h
PORTD_SEG1_MASK                          equ 0002h
PORTD_SEG2_POSN                          equ 0002h
PORTD_SEG2_POSITION                      equ 0002h
PORTD_SEG2_SIZE                          equ 0001h
PORTD_SEG2_LENGTH                        equ 0001h
PORTD_SEG2_MASK                          equ 0004h
PORTD_SEG3_POSN                          equ 0003h
PORTD_SEG3_POSITION                      equ 0003h
PORTD_SEG3_SIZE                          equ 0001h
PORTD_SEG3_LENGTH                        equ 0001h
PORTD_SEG3_MASK                          equ 0008h
PORTD_SEG4_POSN                          equ 0004h
PORTD_SEG4_POSITION                      equ 0004h
PORTD_SEG4_SIZE                          equ 0001h
PORTD_SEG4_LENGTH                        equ 0001h
PORTD_SEG4_MASK                          equ 0010h
PORTD_SEG5_POSN                          equ 0005h
PORTD_SEG5_POSITION                      equ 0005h
PORTD_SEG5_SIZE                          equ 0001h
PORTD_SEG5_LENGTH                        equ 0001h
PORTD_SEG5_MASK                          equ 0020h
PORTD_SEG6_POSN                          equ 0006h
PORTD_SEG6_POSITION                      equ 0006h
PORTD_SEG6_SIZE                          equ 0001h
PORTD_SEG6_LENGTH                        equ 0001h
PORTD_SEG6_MASK                          equ 0040h
PORTD_SEG7_POSN                          equ 0007h
PORTD_SEG7_POSITION                      equ 0007h
PORTD_SEG7_SIZE                          equ 0001h
PORTD_SEG7_LENGTH                        equ 0001h
PORTD_SEG7_MASK                          equ 0080h
PORTD_CTPLS_POSN                         equ 0000h
PORTD_CTPLS_POSITION                     equ 0000h
PORTD_CTPLS_SIZE                         equ 0001h
PORTD_CTPLS_LENGTH                       equ 0001h
PORTD_CTPLS_MASK                         equ 0001h
PORTD_T5CKI_POSN                         equ 0001h
PORTD_T5CKI_POSITION                     equ 0001h
PORTD_T5CKI_SIZE                         equ 0001h
PORTD_T5CKI_LENGTH                       equ 0001h
PORTD_T5CKI_MASK                         equ 0002h
PORTD_SDO2_POSN                          equ 0004h
PORTD_SDO2_POSITION                      equ 0004h
PORTD_SDO2_SIZE                          equ 0001h
PORTD_SDO2_LENGTH                        equ 0001h
PORTD_SDO2_MASK                          equ 0010h
PORTD_SDI2_POSN                          equ 0005h
PORTD_SDI2_POSITION                      equ 0005h
PORTD_SDI2_SIZE                          equ 0001h
PORTD_SDI2_LENGTH                        equ 0001h
PORTD_SDI2_MASK                          equ 0020h
PORTD_SCK2_POSN                          equ 0006h
PORTD_SCK2_POSITION                      equ 0006h
PORTD_SCK2_SIZE                          equ 0001h
PORTD_SCK2_LENGTH                        equ 0001h
PORTD_SCK2_MASK                          equ 0040h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h
PORTD_T7G_POSN                           equ 0001h
PORTD_T7G_POSITION                       equ 0001h
PORTD_T7G_SIZE                           equ 0001h
PORTD_T7G_LENGTH                         equ 0001h
PORTD_T7G_MASK                           equ 0002h
PORTD_SDA2_POSN                          equ 0005h
PORTD_SDA2_POSITION                      equ 0005h
PORTD_SDA2_SIZE                          equ 0001h
PORTD_SDA2_LENGTH                        equ 0001h
PORTD_SDA2_MASK                          equ 0020h
PORTD_SCL2_POSN                          equ 0006h
PORTD_SCL2_POSITION                      equ 0006h
PORTD_SCL2_SIZE                          equ 0001h
PORTD_SCL2_LENGTH                        equ 0001h
PORTD_SCL2_MASK                          equ 0040h

